Tekla.Structures.Plugins.CustomPartPositioningTypeAttribute
The CustomPartPositioningTypeAttribute class is used for defining the positioning type for custom part.
The attribute is initialized from the custom attribute
[CustomPartPositioningTypeAttribute(CustomPartBase.CustomPartPositioningType.POSITIONING_BY_EXTREMA)]
in the custom part source.